In [133]:
person={
    #key : #Value
    "first" : "corey",
    "last"  : "Schafer",
    "email" : "corey@gmail.com"
}

In [134]:
people={
    #key : #Value
    "first" : ["corey"],
    "last"  : ["Schafer"],
    "email" : ["corey@gmail.com"]
}

In [135]:
people={
    #key : #Value
    "first_name" : ["corey","jane","john","adam"],
    "last_name"  : ["Schafer","doe","hez","Doe"],
    "email" : ["corey@gmail.com","jane@gmail.com","john@hotmail.com","adam@gmail.com"]
}

In [136]:
people["email"]

['corey@gmail.com', 'jane@gmail.com', 'john@hotmail.com', 'adam@gmail.com']

In [137]:
import pandas as pd

In [138]:
df=pd.DataFrame(people)
df

  first_name last_name             email
0      corey   Schafer   corey@gmail.com
1       jane       doe    jane@gmail.com
2       john       hez  john@hotmail.com
3       adam       Doe    adam@gmail.com

In [139]:
df[['last_name','email']]

  last_name             email
0   Schafer   corey@gmail.com
1       doe    jane@gmail.com
2       hez  john@hotmail.com
3       Doe    adam@gmail.com

In [140]:
print(f"Find Type :\ntype(df)   :   {type(df)},\ntype(df['email'])  :   {type(df['email'])}\ntype(df[['last_name','email']]) :   {type(df[['last_name','email']])}")

Find Type :
type(df)   :   <class 'pandas.core.frame.DataFrame'>,
type(df['email'])  :   <class 'pandas.core.series.Series'>
type(df[['last_name','email']]) :   <class 'pandas.core.frame.DataFrame'>

In [141]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [142]:
#1.loc - Location ; 2. iloc - index location
df.iloc[[0,1],[0,1]] #df.iloc[listof[row,row],listof[column,column]]

  first_name last_name
0      corey   Schafer
1       jane       doe

In [143]:
df.loc[[0,1],['last_name','email']] #df.loc[listof[row,row],listof[column,column]]

  last_name            email
0   Schafer  corey@gmail.com
1       doe   jane@gmail.com

In [144]:
df.set_index('email',inplace=True) # Set Index
df

                 first_name last_name
email
corey@gmail.com       corey   Schafer
jane@gmail.com         jane       doe
john@hotmail.com       john       hez
adam@gmail.com         adam       Doe

In [145]:
df.index

Index(['corey@gmail.com', 'jane@gmail.com', 'john@hotmail.com',
       'adam@gmail.com'],
      dtype='object', name='email')

In [146]:
df.loc['corey@gmail.com'] # Search using Search index

first_name      corey
last_name     Schafer
Name: corey@gmail.com, dtype: object

In [147]:
df.reset_index(inplace=True)
df

              email first_name last_name
0   corey@gmail.com      corey   Schafer
1    jane@gmail.com       jane       doe
2  john@hotmail.com       john       hez
3    adam@gmail.com       adam       Doe

Filter

In [148]:
filt = (df['last_name']=='Schafer') | (df['first_name']=='jane')

In [149]:
df[filt]# do this instead of df[df['last']=='doe']

             email first_name last_name
0  corey@gmail.com      corey   Schafer
1   jane@gmail.com       jane       doe

In [150]:
df.loc[filt,'email'] , df.loc[-filt,'email'] #Negative 'not'  -filt

(0    corey@gmail.com
 1     jane@gmail.com
 Name: email, dtype: object,
 2    john@hotmail.com
 3      adam@gmail.com
 Name: email, dtype: object)

Updating rows,Columns - Modifying Data Withi Data Frame

In [151]:
# Capitalize the Column Names
df.columns=[x.upper() for x in df.columns]
df

              EMAIL FIRST_NAME LAST_NAME
0   corey@gmail.com      corey   Schafer
1    jane@gmail.com       jane       doe
2  john@hotmail.com       john       hez
3    adam@gmail.com       adam       Doe

In [152]:
# Replacing Column name  '_' to 'space'
df.columns= df.columns.str.replace('_',' ')
df

              EMAIL FIRST NAME LAST NAME
0   corey@gmail.com      corey   Schafer
1    jane@gmail.com       jane       doe
2  john@hotmail.com       john       hez
3    adam@gmail.com       adam       Doe

In [153]:
# Change Column Name
df.rename(columns={'FIRST NAME':'first','LAST NAME':'last'},inplace=True)
df

              EMAIL  first     last
0   corey@gmail.com  corey  Schafer
1    jane@gmail.com   jane      doe
2  john@hotmail.com   john      hez
3    adam@gmail.com   adam      Doe

In [154]:
df

              EMAIL  first     last
0   corey@gmail.com  corey  Schafer
1    jane@gmail.com   jane      doe
2  john@hotmail.com   john      hez
3    adam@gmail.com   adam      Doe

In [155]:
#Change a complte Object details
df.loc[2]=['johnsmith@gmail.com','John','Smith']

In [156]:
#Change a Multiple Value in a object;just mension the columns
df.loc[2,['EMAIL','last']]=['johnsmith@gmail.com','doe']

In [157]:
df

                 EMAIL  first     last
0      corey@gmail.com  corey  Schafer
1       jane@gmail.com   jane      doe
2  johnsmith@gmail.com   John      doe
3       adam@gmail.com   adam      Doe

In [158]:
#Change a Single Value in a object;just mension the columns
df.loc[1:2,['last']]=['Doe']  #or df.at[2,'last'] = 'Doe'

In [159]:
df

                 EMAIL  first     last
0      corey@gmail.com  corey  Schafer
1       jane@gmail.com   jane      Doe
2  johnsmith@gmail.com   John      Doe
3       adam@gmail.com   adam      Doe

In [160]:
filt=(df['EMAIL']=='johnsmith@gmail.com')
df[filt]['last']='Smith'
#Warning

df.loc[filt,'last'] = 'Smith' 
# Using loc to do so

C:\Users\nandu\AppData\Local\Temp\ipykernel_20856\312259523.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last']='Smith'

In [161]:
df

                 EMAIL  first     last
0      corey@gmail.com  corey  Schafer
1       jane@gmail.com   jane      Doe
2  johnsmith@gmail.com   John    Smith
3       adam@gmail.com   adam      Doe

.apply - Method
=

In [162]:
# Length 
df['EMAIL'].apply(len)

0    15
1    14
2    19
3    14
Name: EMAIL, dtype: int64

In [163]:
def Update_Email(email):
    return email.upper()

In [164]:
#Putting Function inside apply method
df['EMAIL'].apply(Update_Email) #their is no change to the df untill it assign permanently
df['EMAIL']=df['EMAIL'].apply(Update_Email)

In [165]:
df

                 EMAIL  first     last
0      COREY@GMAIL.COM  corey  Schafer
1       JANE@GMAIL.COM   jane      Doe
2  JOHNSMITH@GMAIL.COM   John    Smith
3       ADAM@GMAIL.COM   adam      Doe

In [166]:
#Using Lambda Function
df['EMAIL']=df['EMAIL'].apply(lambda x:x.lower())

In [167]:
df

                 EMAIL  first     last
0      corey@gmail.com  corey  Schafer
1       jane@gmail.com   jane      Doe
2  johnsmith@gmail.com   John    Smith
3       adam@gmail.com   adam      Doe

In [168]:
#Length
df.apply(len), len(df['EMAIL']),df.apply(len,axis='rows')

(EMAIL    4
 first    4
 last     4
 dtype: int64,
 4,
 EMAIL    4
 first    4
 last     4
 dtype: int64)

In [169]:
df

                 EMAIL  first     last
0      corey@gmail.com  corey  Schafer
1       jane@gmail.com   jane      Doe
2  johnsmith@gmail.com   John    Smith
3       adam@gmail.com   adam      Doe

In [170]:
#finding min and max
df.apply(pd.Series.min) , df.apply(pd.Series.max)

(EMAIL    adam@gmail.com
 first              John
 last                Doe
 dtype: object,
 EMAIL    johnsmith@gmail.com
 first                   jane
 last                   Smith
 dtype: object)

In [171]:
df.apply(lambda x:x.min()),df.apply(lambda x:x.max())

(EMAIL    adam@gmail.com
 first              John
 last                Doe
 dtype: object,
 EMAIL    johnsmith@gmail.com
 first                   jane
 last                   Smith
 dtype: object)

.applymap
==

In [172]:
df.applymap(len)

   EMAIL  first  last
0     15      5     7
1     14      4     3
2     19      4     5
3     14      4     3

In [173]:
df.applymap(str.lower)

                 EMAIL  first     last
0      corey@gmail.com  corey  schafer
1       jane@gmail.com   jane      doe
2  johnsmith@gmail.com   john    smith
3       adam@gmail.com   adam      doe

.map
==

In [174]:
df

                 EMAIL  first     last
0      corey@gmail.com  corey  Schafer
1       jane@gmail.com   jane      Doe
2  johnsmith@gmail.com   John    Smith
3       adam@gmail.com   adam      Doe

In [175]:
df['first'].map({'corey':'Ragav','jane':'Johny'})
#Similar to replace method in 146 th and down below code. but in map if you didn't provide any valu. e it become 'NaN'

0    Ragav
1    Johny
2      NaN
3      NaN
Name: first, dtype: object

In [176]:
df['first'].replace({'corey':'Ragav','jane':'Johny'})

0    Ragav
1    Johny
2     John
3     adam
Name: first, dtype: object

Add , Remove and Split
=

In [177]:
#Add Columns
df['fullname']=df['first']+' '+df['last']
df

                 EMAIL  first     last       fullname
0      corey@gmail.com  corey  Schafer  corey Schafer
1       jane@gmail.com   jane      Doe       jane Doe
2  johnsmith@gmail.com   John    Smith     John Smith
3       adam@gmail.com   adam      Doe       adam Doe

In [178]:
#Remove Columns
df.drop(columns=['first','last']) #if imolace=True then it will affect

                 EMAIL       fullname
0      corey@gmail.com  corey Schafer
1       jane@gmail.com       jane Doe
2  johnsmith@gmail.com     John Smith
3       adam@gmail.com       adam Doe

In [179]:
#Split Data
df['fullname'].str.split(' ') , df['fullname'].str.split(' ',expand=True)

(0    [corey, Schafer]
 1         [jane, Doe]
 2       [John, Smith]
 3         [adam, Doe]
 Name: fullname, dtype: object,
        0        1
 0  corey  Schafer
 1   jane      Doe
 2   John    Smith
 3   adam      Doe)

In [180]:
#Add Multiple Columns
df[['first','last']]=df['fullname'].str.split(' ',expand=True)
df

                 EMAIL  first     last       fullname
0      corey@gmail.com  corey  Schafer  corey Schafer
1       jane@gmail.com   jane      Doe       jane Doe
2  johnsmith@gmail.com   John    Smith     John Smith
3       adam@gmail.com   adam      Doe       adam Doe

In [181]:
#Add New row
#df=pd.concat({'first':'tony'},ignore_index=True)

In [182]:
people2={
    #key : #Value
    "first_name" : ["Nandu","Reshmi","Neethu"],
    "last_name"  : ["AY","Sankar","AY"],
    "email" : ["nandu@gmail.com","reshmi@gmail.com","neethu@hotmail.com"]
}
df2=pd.DataFrame(people2)

In [183]:
df2

  first_name last_name               email
0      Nandu        AY     nandu@gmail.com
1     Reshmi    Sankar    reshmi@gmail.com
2     Neethu        AY  neethu@hotmail.com

In [184]:
#Remove a Row

#df.drop(index=1)

filt=df['last']=='Doe'
df.drop(index=df[filt].index)

                 EMAIL  first     last       fullname
0      corey@gmail.com  corey  Schafer  corey Schafer
2  johnsmith@gmail.com   John    Smith     John Smith

Sorting Data
=

In [185]:
df['last']=df['last'].replace({'Smith':'Doe'})

In [186]:
df

                 EMAIL  first     last       fullname
0      corey@gmail.com  corey  Schafer  corey Schafer
1       jane@gmail.com   jane      Doe       jane Doe
2  johnsmith@gmail.com   John      Doe     John Smith
3       adam@gmail.com   adam      Doe       adam Doe

In [187]:
df.sort_values(by='last', ascending=True)

                 EMAIL  first     last       fullname
1       jane@gmail.com   jane      Doe       jane Doe
2  johnsmith@gmail.com   John      Doe     John Smith
3       adam@gmail.com   adam      Doe       adam Doe
0      corey@gmail.com  corey  Schafer  corey Schafer

In [188]:
df.sort_values(by=['last','first'],ascending=False)

                 EMAIL  first     last       fullname
0      corey@gmail.com  corey  Schafer  corey Schafer
1       jane@gmail.com   jane      Doe       jane Doe
3       adam@gmail.com   adam      Doe       adam Doe
2  johnsmith@gmail.com   John      Doe     John Smith

In [189]:
df.sort_values(by=['last','first'],ascending=[False,True],inplace=True)

In [190]:
df

                 EMAIL  first     last       fullname
0      corey@gmail.com  corey  Schafer  corey Schafer
2  johnsmith@gmail.com   John      Doe     John Smith
3       adam@gmail.com   adam      Doe       adam Doe
1       jane@gmail.com   jane      Doe       jane Doe

Cleaning Data - Casting Datatypes and Handling Missing Values - Playing with Nan
=

In [191]:
import numpy as np

In [192]:
#Data

people3={
    #key : #Value
    "first" : ["Nandu","Reshmi","Neethu",np.nan,None,"NA"],
    "last"  : ["AY","Sankar","AY",np.nan,np.nan,"Missing"],
    "email" : ["nandu@gmail.com","reshmi@gmail.com","neethu@hotmail.com",None,"Anonymouse@mail.com","NA"],
    "age"   : ["27","26","20",None,None,"Missing"]
}

In [218]:
#Data to Dataframe
df3=pd.DataFrame(people3)
print(df3)
df3.replace('NA',np.nan,inplace=True)
df3.replace('Missing',np.nan,inplace=True)
df3

    first     last                email      age
0   Nandu       AY      nandu@gmail.com       27
1  Reshmi   Sankar     reshmi@gmail.com       26
2  Neethu       AY   neethu@hotmail.com       20
3     NaN      NaN                 None     None
4    None      NaN  Anonymouse@mail.com     None
5      NA  Missing                   NA  Missing

    first    last                email   age
0   Nandu      AY      nandu@gmail.com    27
1  Reshmi  Sankar     reshmi@gmail.com    26
2  Neethu      AY   neethu@hotmail.com    20
3     NaN     NaN                 None  None
4    None     NaN  Anonymouse@mail.com  None
5     NaN     NaN                  NaN   NaN

In [219]:
df3.dropna()

    first    last               email age
0   Nandu      AY     nandu@gmail.com  27
1  Reshmi  Sankar    reshmi@gmail.com  26
2  Neethu      AY  neethu@hotmail.com  20

In [220]:
df3.dropna(axis='index',how='all',subset=['last','email']) # act like Or Statement --> last || email

    first    last                email   age
0   Nandu      AY      nandu@gmail.com    27
1  Reshmi  Sankar     reshmi@gmail.com    26
2  Neethu      AY   neethu@hotmail.com    20
4    None     NaN  Anonymouse@mail.com  None

In [222]:
df3.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True   True  False   True
5   True   True   True   True

In [223]:
df3.fillna('MISSINGVAL')

        first        last                email         age
0       Nandu          AY      nandu@gmail.com          27
1      Reshmi      Sankar     reshmi@gmail.com          26
2      Neethu          AY   neethu@hotmail.com          20
3  MISSINGVAL  MISSINGVAL           MISSINGVAL  MISSINGVAL
4  MISSINGVAL  MISSINGVAL  Anonymouse@mail.com  MISSINGVAL
5  MISSINGVAL  MISSINGVAL           MISSINGVAL  MISSINGVAL

In [227]:
#np.nan is Float ..... Oops!
type(np.nan)

float

In [234]:
df3.dtypes  # dtype used as a alternator type() of function

first     object
last      object
email     object
age      float64
dtype: object

In [231]:
#using ' astype ' can convert any series into mensioned type . under condition
df3['age']=df3['age'].astype(float) #their should be a error if int is choosen, because NaN is a Float, you should be choose Float or replace NaN to '0' for finding average here.
df3['age'].mean()

24.333333333333332

In [235]:
df3.dtypes

first     object
last      object
email     object
age      float64
dtype: object